using System.Collections;
using System.Collections.Generic;

static class QuestionCollection {

    public static string[,] questions  = new string[,]{
        
        {"こんにちは世界", "こんにちはせかい"},
        {"変数aは既に定義されています", "へんすうaはすでにていぎされています"},
        {"親の顔より見たsegmentation fault", "おやのかおよりみたsegmentationfault"},
        {"微分、積分、いい気分。", "びぶん、せきぶん、いいきぶん。"},
        {"エディタ戦争Vim vs Emacs", "えでぃたせんそうVimvsEmacs"},
        {"亀の化石レポート", "かめのかせきれぽーと"},
        {"はじめての呪文 include", "はじめてのじゅもんinclude"},
        {"enqueueする買い物客", "enqueueするかいものきゃく"},
        {"実は！体脂肪をへらす", "じつは！たいしぼうをへらす"},
        {"優れた技術者は優れた人間でなくてはならない","すぐれたぎじゅつしゃはすぐれたにんげんでなくてはならない"},
        {"非常にナンセンス","ひじょうになんせんす"},
        {"曖昧な3センチ","あいまいな3せんち"},
        {"大いなる力には大いなる責任が伴う","おおいなるちからにはおおいなるせきにんがともなう"},
        {"高専10年計画","こうせん10ねんけいかく"},
        {"私とあなたで3way-handshake","わたしとあなたで3way-handshake"},
        {"やさしいC","やさしいC"},
        {"アルミホイルの帽子","あるみほいるのぼうし"},
        {"百人一首ベスト100","ひゃくにんいっしゅべすと100"},
        {"おもちゃのちゃちゃちゃ","おもちゃのちゃちゃちゃ"},
        {"誠意のチャーシュー丼","せいいのちゃーしゅーどん"},
        {"はくびしん、たぬき、アライグマ、イタチ。","はくびしん、たぬき、あらいぐま、いたち。"},
        {"すももも桃もモモのうち","すもももももももものうち"},
        {"最後の人生相談","さいごのじんせいそうだん"},
        {"単位補完計画","たんいほかんけいかく"},
        {"終わらない夏休み","おわらないなつやすみ"},
        {"死んだ魚の目 日照不足 シャトルラン部","しんださかなのめにっしょうぶそくしゃとるらんぶ"},
        {"モノクロ大佐","ものくろたいさ"},
        {"女子高生南極観測隊","じょしこうせいなんきょくかんそくたい"},
        {"青森の魔法使い","あおもりのまほうつかい"},
        {"度し難い","どしがたい"},
        
    };
}
